In [2]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in /Users/justbeaver/Library/Python/3.8/lib/python/site-packages (1.2.4)
Requirement already satisfied: numpy>=1.16.5 in /Users/justbeaver/Library/Python/3.8/lib/python/site-packages (from pandas) (1.20.1)
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/justbeaver/Library/Python/3.8/lib/python/site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in /Users/justbeaver/Library/Python/3.8/lib/python/site-packages (from pandas) (2021.1)
Requirement already satisfied: six>=1.5 in /Library/Developer/CommandLineTools/Library/Frameworks/Python3.framework/Versions/3.8/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
pip install numpy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: numpy in /Users/justbeaver/Library/Python/3.8/lib/python/site-packages (1.20.1)
Note: you may need to restart the kernel to use updated packages.

In [16]:
pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: openpyxl in /Users/justbeaver/Library/Python/3.8/lib/python/site-packages (3.0.9)
Requirement already satisfied: et-xmlfile in /Users/justbeaver/Library/Python/3.8/lib/python/site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd
import numpy as np

## Pandas Operation

In [5]:
# Series Operation

s1 = pd.Series(
    range(1,6), index=list("abced")
)
s1

a    1
b    2
c    3
e    4
d    5
dtype: int64

In [6]:
s2 = pd.Series(
    range(5,11), index=list("bcedef")
)
s2

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int64

In [7]:
s1.add(s2)  # 겹치는 index가 없을 경우 NaN 값으로 반환
# s1 + s2

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [8]:
# DataFrame Operation

df1 = pd.DataFrame(
    np.arange(9).reshape(3,3), columns=list("abc")
)
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [9]:
df2 = pd.DataFrame(
    np.arange(16).reshape(4,4), columns=list("abcd")
)
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [10]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [11]:
df1.add(df2, fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

In [12]:
# Series + DataFrame

df = pd.DataFrame(
    np.arange(16).reshape(4,4), columns=list("abcd")
)
s2 = pd.Series(np.arange(10,14))

df + s2

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [13]:
df.add(s2,axis=0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

## Lambda, Map, Apply

In [14]:
s3 = pd.Series(np.arange(10))
s3.head()

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [15]:
s3.map(lambda x: x**2).head()

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [26]:
ex = [1,2,3,4,5]
f = lambda x: x ** 2
list(map(f,ex))

[1, 4, 9, 16, 25]

In [27]:
f = lambda x, y: x + y
list(map(f,ex,ex))

[2, 4, 6, 8, 10]

In [28]:
list(map(lambda x: x+5, ex))

[6, 7, 8, 9, 10]

In [17]:
df = pd.read_excel("input_file/titanic.xlsx")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
df.Sex.unique()

array(['male', 'female'], dtype=object)

In [20]:
df["Sex_Code"] = df.Sex.map({"male":0, "female":1})
df.head(2).T

,0,1
PassengerId,1,2
Survived,0,1
Pclass,3,1
Name,"Braund, Mr. Owen Harris","Cumings, Mrs. John Bradley (Florence Briggs Th..."
Sex,male,female
Age,22.0,38.0
SibSp,1,1
Parch,0,0
Ticket,A/5 21171,PC 17599
Fare,7.25,71.2833
Cabin,NaN,C85
Embarked,S,C
Sex_Code,0,1

In [24]:
df.Sex.replace(
    {"male":0, "female":1}
).head()

0    0
1    1
2    1
3    1
4    0
Name: Sex, dtype: int64

In [25]:
df.Sex.replace(
    ["male","female"],
    [0,1], inplace=True
)
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_Code
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1

In [30]:
s4 = pd.Series(np.arange(10))

In [32]:
def f(x):
    return x+5

s4.map(f)

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    12
8    13
9    14
dtype: int64

In [33]:
s4

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [35]:
z = {1: "A", 2: "B", 3: "C"}
s4.map(z)

0    NaN
1      A
2      B
3      C
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

In [38]:
s5 = pd.Series(np.arange(10,30))
s4.map(s5)  #s4의 index는 9까지만 있으므로 9까지만 영향

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int64

In [40]:
# Apply & Apply Map

df = pd.read_excel("input_file/titanic.xlsx")
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [46]:
df_info = df[['Age','Fare']]
df_info.head(2)

    Age     Fare
0  22.0   7.2500
1  38.0  71.2833

In [47]:
f = lambda x: np.mean(x)
df_info.apply(f)

Age     29.699118
Fare    32.204208
dtype: float64

In [48]:
df_info.apply(np.mean)

Age     29.699118
Fare    32.204208
dtype: float64

In [49]:
df_info.mean()

Age     29.699118
Fare    32.204208
dtype: float64

In [51]:
def f(x):
    return pd.Series(
        [x.min(), x.max(), x.mean(), sum(x.isnull())],
        index = ["min", "max", "mean", "null"]
    )

df_info.apply(f)

             Age        Fare
min     0.420000    0.000000
max    80.000000  512.329200
mean   29.699118   32.204208
null  177.000000    0.000000

In [53]:
f = lambda x: x // 2
df_info.applymap(f).head()

    Age  Fare
0  11.0   3.0
1  19.0  35.0
2  13.0   3.0
3  17.0  26.0
4  17.0   4.0

In [55]:
f = lambda x: x ** 2
df_info["Fare"].apply(f)

0        52.562500
1      5081.308859
2        62.805625
3      2819.610000
4        64.802500
          ...
886     169.000000
887     900.000000
888     549.902500
889     900.000000
890      60.062500
Name: Fare, Length: 891, dtype: float64